black-box-iot/black-box-iot.github.io/BlackBox-2.2.0/boards.txt
2561.menu.clock.14_7456MHz_external=External 14.7456 MHz
2561.menu.clock.14_7456MHz_external.upload.speed=115200
2561.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.14_7456MHz_external.build.clkpr=
2561.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

2561.menu.clock.12MHz_external=External 12 MHz
2561.menu.clock.12MHz_external.upload.speed=57600
2561.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.12MHz_external.build.clkpr=
2561.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.12MHz_external.build.f_cpu=12000000L

2561.menu.clock.11_0592MHz_external=External 11.0592 MHz
2561.menu.clock.11_0592MHz_external.upload.speed=115200
2561.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.11_0592MHz_external.build.clkpr=
2561.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

2561.menu.clock.8MHz_external=External 8 MHz
2561.menu.clock.8MHz_external.upload.speed=57600
2561.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.8MHz_external.build.clkpr=
2561.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.8MHz_external.build.f_cpu=8000000L

2561.menu.clock.7_3728MHz_external=External 7.3728 MHz
2561.menu.clock.7_3728MHz_external.upload.speed=115200
2561.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.7_3728MHz_external.build.clkpr=
2561.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

2561.menu.clock.4MHz_external=External 4 MHz
2561.menu.clock.4MHz_external.upload.speed=9600
2561.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.4MHz_external.build.clkpr=
2561.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.4MHz_external.build.f_cpu=4000000L

2561.menu.clock.3_6864MHz_external=External 3.6864 MHz
2561.menu.clock.3_6864MHz_external.upload.speed=115200
2561.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.3_6864MHz_external.build.clkpr=
2561.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

2561.menu.clock.2MHz_external=External 2 MHz
2561.menu.clock.2MHz_external.upload.speed=9600
2561.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.2MHz_external.build.clkpr=
2561.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.2MHz_external.build.f_cpu=2000000L

2561.menu.clock.1_8432MHz_external=External 1.8432 MHz
2561.menu.clock.1_8432MHz_external.upload.speed=115200
2561.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.1_8432MHz_external.build.clkpr=
2561.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

2561.menu.clock.1MHz_external=External 1 MHz
2561.menu.clock.1MHz_external.upload.speed=9600
2561.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.1MHz_external.build.clkpr=
2561.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.1MHz_external.build.f_cpu=1000000L

2561.menu.clock.8MHz_internal=Internal 8 MHz
2561.menu.clock.8MHz_internal.upload.speed=38400
2561.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.8MHz_internal.build.clkpr=
2561.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
2561.menu.clock.8MHz_internal.build.f_cpu=8000000L

2561.menu.clock.4MHz_internal=Internal 4 MHz
2561.menu.clock.4MHz_internal.upload.speed=9600
2561.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
2561.menu.clock.4MHz_internal.build.clock_speed=8000000L
2561.menu.clock.4MHz_internal.build.f_cpu=4000000L

2561.menu.clock.2MHz_internal=Internal 2 MHz
2561.menu.clock.2MHz_internal.upload.speed=9600
2561.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
2561.menu.clock.2MHz_internal.build.clock_speed=8000000L
2561.menu.clock.2MHz_internal.build.f_cpu=2000000L

2561.menu.clock.1MHz_internal=Internal 1 MHz
2561.menu.clock.1MHz_internal.upload.speed=9600
2561.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2561.menu.clock.1MHz_internal.build.clkpr=
2561.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
2561.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega2560  ####
#####################

# General
2560.name=ATmega2560
2560.upload.tool=avrdude
2560.upload.maximum_data_size=8192
2560.bootloader.tool=avrdude
2560.bootloader.unlock_bits=0xff
2560.bootloader.lock_bits=0xcf
2560.build.core=MCUdude_corefiles
2560.build.board=AVR_ATmega2560
2560.build.mcu=atmega2560
2560.build.bootloader_led=B7
2560.build.extra_flags={build.clkpr}

# Upload port select
2560.menu.bootloader.uart0=Yes (UART0)
2560.menu.bootloader.uart0.upload.maximum_size=261120
2560.menu.bootloader.uart0.upload.protocol=arduino
2560.menu.bootloader.uart0.upload.port=UART0
2560.menu.bootloader.uart0.build.export_merged_output=true
2560.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

2560.menu.bootloader.uart1=Yes (UART1)
2560.menu.bootloader.uart1.upload.maximum_size=261120
2560.menu.bootloader.uart1.upload.protocol=arduino
2560.menu.bootloader.uart1.upload.port=UART1
2560.menu.bootloader.uart1.build.export_merged_output=true
2560.menu.bootloader.uart1.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

2560.menu.bootloader.uart2=Yes (UART2)
2560.menu.bootloader.uart2.upload.maximum_size=261120
2560.menu.bootloader.uart2.upload.protocol=arduino
2560.menu.bootloader.uart2.upload.port=UART2
2560.menu.bootloader.uart2.build.export_merged_output=true
2560.menu.bootloader.uart2.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart2.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

2560.menu.bootloader.uart3=Yes (UART3)
2560.menu.bootloader.uart3.upload.maximum_size=261120
2560.menu.bootloader.uart3.upload.protocol=arduino
2560.menu.bootloader.uart3.upload.port=UART3
2560.menu.bootloader.uart3.build.export_merged_output=true
2560.menu.bootloader.uart3.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart3.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

