black-box-iot/black-box-iot.github.io/BlackBox-2.2.0/boards.txt
# Variants
649.menu.variant.model649P=649P/PA
649.menu.variant.model649P.build.mcu=atmega649p
649.menu.variant.model649P.build.variant=64-pin-avr
649.menu.variant.model649P.build.board=AVR_ATmega649
649.menu.variant.model649P.build.bootloader_led=B5

649.menu.variant.model649=649/A
649.menu.variant.model649.build.mcu=atmega649
649.menu.variant.model649.build.variant=64-pin-avr
649.menu.variant.model649.build.board=AVR_ATmega649
649.menu.variant.model649.build.bootloader_led=B5

649.menu.variant.model6490P=6490P/PA
649.menu.variant.model6490P.build.mcu=atmega6490p
649.menu.variant.model6490P.build.variant=100-pin-avr
649.menu.variant.model6490P.build.board=AVR_ATmega6490
649.menu.variant.model6490P.build.bootloader_led=B7

649.menu.variant.model6490=6490/A
649.menu.variant.model6490.build.mcu=atmega6490
649.menu.variant.model6490.build.variant=100-pin-avr
649.menu.variant.model6490.build.board=AVR_ATmega6490
649.menu.variant.model6490.build.bootloader_led=B7

# Brown out detection
649.menu.BOD.2v7=BOD 2.7V
649.menu.BOD.2v7.bootloader.extended_fuses=0xfb
649.menu.BOD.4v3=BOD 4.3V
649.menu.BOD.4v3.bootloader.extended_fuses=0xf9
649.menu.BOD.1v8=BOD 1.8V
649.menu.BOD.1v8.bootloader.extended_fuses=0xfd
649.menu.BOD.disabled=BOD disabled
649.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
649.menu.LTO.Os=LTO disabled
649.menu.LTO.Os.compiler.c.extra_flags=
649.menu.LTO.Os.compiler.c.elf.extra_flags=
649.menu.LTO.Os.compiler.cpp.extra_flags=
649.menu.LTO.Os.ltoarcmd=avr-ar

649.menu.LTO.Os_flto=LTO enabled
649.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
649.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
649.menu.clock.16MHz_external=External 16 MHz
649.menu.clock.16MHz_external.upload.speed=115200
649.menu.clock.16MHz_external.bootloader.low_fuses=0xff
649.menu.clock.16MHz_external.build.clkpr=
649.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.16MHz_external.build.f_cpu=16000000L

649.menu.clock.20MHz_external=External 20 MHz
649.menu.clock.20MHz_external.upload.speed=115200
649.menu.clock.20MHz_external.bootloader.low_fuses=0xff
649.menu.clock.20MHz_external.build.clkpr=
649.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.20MHz_external.build.f_cpu=20000000L

649.menu.clock.18_432MHz_external=External 18.4320 MHz
649.menu.clock.18_432MHz_external.upload.speed=115200
649.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.18_432MHz_external.build.clkpr=
649.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.18_432MHz_external.build.f_cpu=18432000L

649.menu.clock.14_7456MHz_external=External 14.7456 MHz
649.menu.clock.14_7456MHz_external.upload.speed=115200
649.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
649.menu.clock.14_7456MHz_external.build.clkpr=
649.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

649.menu.clock.12MHz_external=External 12 MHz
649.menu.clock.12MHz_external.upload.speed=57600
649.menu.clock.12MHz_external.bootloader.low_fuses=0xff
649.menu.clock.12MHz_external.build.clkpr=
649.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.12MHz_external.build.f_cpu=12000000L

649.menu.clock.11_0592MHz_external=External 11.0592 MHz
649.menu.clock.11_0592MHz_external.upload.speed=115200
649.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
649.menu.clock.11_0592MHz_external.build.clkpr=
649.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

649.menu.clock.8MHz_external=External 8 MHz
649.menu.clock.8MHz_external.upload.speed=57600
649.menu.clock.8MHz_external.bootloader.low_fuses=0xff
649.menu.clock.8MHz_external.build.clkpr=
649.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.8MHz_external.build.f_cpu=8000000L

649.menu.clock.7_3728MHz_external=External 7.3728 MHz
649.menu.clock.7_3728MHz_external.upload.speed=115200
649.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
649.menu.clock.7_3728MHz_external.build.clkpr=
649.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

649.menu.clock.4MHz_external=External 4 MHz
649.menu.clock.4MHz_external.upload.speed=9600
649.menu.clock.4MHz_external.bootloader.low_fuses=0xff
649.menu.clock.4MHz_external.build.clkpr=
649.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.4MHz_external.build.f_cpu=4000000L

649.menu.clock.3_6864MHz_external=External 3.6864 MHz
649.menu.clock.3_6864MHz_external.upload.speed=115200
649.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
649.menu.clock.3_6864MHz_external.build.clkpr=
649.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

649.menu.clock.2MHz_external=External 2 MHz
649.menu.clock.2MHz_external.upload.speed=9600
649.menu.clock.2MHz_external.bootloader.low_fuses=0xff
649.menu.clock.2MHz_external.build.clkpr=
649.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.2MHz_external.build.f_cpu=2000000L

649.menu.clock.1_8432MHz_external=External 1.8432 MHz
649.menu.clock.1_8432MHz_external.upload.speed=115200
649.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1_8432MHz_external.build.clkpr=
649.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

649.menu.clock.1MHz_external=External 1 MHz
649.menu.clock.1MHz_external.upload.speed=9600
649.menu.clock.1MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1MHz_external.build.clkpr=
649.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.1MHz_external.build.f_cpu=1000000L

649.menu.clock.8MHz_internal=Internal 8 MHz
649.menu.clock.8MHz_internal.upload.speed=38400
649.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.8MHz_internal.build.clkpr=
649.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
649.menu.clock.8MHz_internal.build.f_cpu=8000000L

