black-box-iot/black-box-iot.github.io/BlackBox-2.2.0/boards.txt
649.menu.clock.4MHz_internal=Internal 4 MHz
649.menu.clock.4MHz_internal.upload.speed=9600
649.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
649.menu.clock.4MHz_internal.build.clock_speed=8000000L
649.menu.clock.4MHz_internal.build.f_cpu=4000000L

649.menu.clock.2MHz_internal=Internal 2 MHz
649.menu.clock.2MHz_internal.upload.speed=9600
649.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
649.menu.clock.2MHz_internal.build.clock_speed=8000000L
649.menu.clock.2MHz_internal.build.f_cpu=2000000L

649.menu.clock.1MHz_internal=Internal 1 MHz
649.menu.clock.1MHz_internal.upload.speed=9600
649.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
649.menu.clock.1MHz_internal.build.clkpr=
649.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
649.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
####  ATmega645/6450  ####
##########################

# General
645.name=ATmega645/6450
645.upload.tool=avrdude
645.upload.maximum_data_size=4096
645.bootloader.tool=avrdude
645.bootloader.unlock_bits=0xff
645.bootloader.lock_bits=0xcf
645.build.core=MCUdude_corefiles
645.build.board=AVR_ATmega645
645.build.extra_flags={build.clkpr}

# Upload port select
645.menu.bootloader.uart0=Yes (UART0)
645.menu.bootloader.uart0.upload.maximum_size=64512
645.menu.bootloader.uart0.upload.protocol=arduino
645.menu.bootloader.uart0.upload.port=UART0
645.menu.bootloader.uart0.build.export_merged_output=true
645.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
645.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

645.menu.bootloader.no_bootloader=No bootloader
645.menu.bootloader.no_bootloader.upload.maximum_size=65536
645.menu.bootloader.no_bootloader.build.export_merged_output=false
645.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
645.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
645.menu.eeprom.keep=EEPROM retained
645.menu.eeprom.keep.bootloader.eesave_bit=0
645.menu.eeprom.erase=EEPROM not retained
645.menu.eeprom.erase.bootloader.eesave_bit=1

# Variants
645.menu.variant.model645P=645P/PA
645.menu.variant.model645P.build.mcu=atmega645p
645.menu.variant.model645P.build.variant=64-pin-avr
645.menu.variant.model645P.build.board=AVR_ATmega645
645.menu.variant.model645P.build.bootloader_led=B5

645.menu.variant.model645=645/A
645.menu.variant.model645.build.mcu=atmega645
645.menu.variant.model645.build.variant=64-pin-avr
645.menu.variant.model645.build.board=AVR_ATmega645
645.menu.variant.model645.build.bootloader_led=B5

645.menu.variant.model6450P=6450P
645.menu.variant.model6450P.build.mcu=atmega6450p
645.menu.variant.model6450P.build.variant=100-pin-avr
645.menu.variant.model6450P.build.board=AVR_ATmega6450
645.menu.variant.model6450P.build.bootloader_led=B7

645.menu.variant.model6450=6450/A
645.menu.variant.model6450.build.mcu=atmega6450
645.menu.variant.model6450.build.variant=100-pin-avr
645.menu.variant.model6450.build.board=AVR_ATmega6450
645.menu.variant.model6450.build.bootloader_led=B7

# Brown out detection
645.menu.BOD.2v7=BOD 2.7V
645.menu.BOD.2v7.bootloader.extended_fuses=0xfb
645.menu.BOD.4v3=BOD 4.3V
645.menu.BOD.4v3.bootloader.extended_fuses=0xf9
645.menu.BOD.1v8=BOD 1.8V
645.menu.BOD.1v8.bootloader.extended_fuses=0xfd
645.menu.BOD.disabled=BOD disabled
645.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
645.menu.LTO.Os=LTO disabled
645.menu.LTO.Os.compiler.c.extra_flags=
645.menu.LTO.Os.compiler.c.elf.extra_flags=
645.menu.LTO.Os.compiler.cpp.extra_flags=
645.menu.LTO.Os.ltoarcmd=avr-ar

645.menu.LTO.Os_flto=LTO enabled
645.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
645.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
645.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
645.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
645.menu.clock.16MHz_external=External 16 MHz
645.menu.clock.16MHz_external.upload.speed=115200
645.menu.clock.16MHz_external.bootloader.low_fuses=0xff
645.menu.clock.16MHz_external.build.clkpr=
645.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.16MHz_external.build.f_cpu=16000000L

645.menu.clock.20MHz_external=External 20 MHz
645.menu.clock.20MHz_external.upload.speed=115200
645.menu.clock.20MHz_external.bootloader.low_fuses=0xff
645.menu.clock.20MHz_external.build.clkpr=
645.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.20MHz_external.build.f_cpu=20000000L

645.menu.clock.18_432MHz_external=External 18.4320 MHz
645.menu.clock.18_432MHz_external.upload.speed=115200
645.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
645.menu.clock.18_432MHz_external.build.clkpr=
645.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.18_432MHz_external.build.f_cpu=18432000L

645.menu.clock.14_7456MHz_external=External 14.7456 MHz
645.menu.clock.14_7456MHz_external.upload.speed=115200
645.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
645.menu.clock.14_7456MHz_external.build.clkpr=
645.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

645.menu.clock.12MHz_external=External 12 MHz
645.menu.clock.12MHz_external.upload.speed=57600
645.menu.clock.12MHz_external.bootloader.low_fuses=0xff
645.menu.clock.12MHz_external.build.clkpr=
645.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.12MHz_external.build.f_cpu=12000000L

645.menu.clock.11_0592MHz_external=External 11.0592 MHz
645.menu.clock.11_0592MHz_external.upload.speed=115200
645.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
645.menu.clock.11_0592MHz_external.build.clkpr=
645.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

645.menu.clock.8MHz_external=External 8 MHz
645.menu.clock.8MHz_external.upload.speed=57600
645.menu.clock.8MHz_external.bootloader.low_fuses=0xff
645.menu.clock.8MHz_external.build.clkpr=
645.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.8MHz_external.build.f_cpu=8000000L

