black-box-iot/black-box-iot.github.io/BlackBox-2.2.0/boards.txt
645.menu.clock.7_3728MHz_external=External 7.3728 MHz
645.menu.clock.7_3728MHz_external.upload.speed=115200
645.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
645.menu.clock.7_3728MHz_external.build.clkpr=
645.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

645.menu.clock.4MHz_external=External 4 MHz
645.menu.clock.4MHz_external.upload.speed=9600
645.menu.clock.4MHz_external.bootloader.low_fuses=0xff
645.menu.clock.4MHz_external.build.clkpr=
645.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.4MHz_external.build.f_cpu=4000000L

645.menu.clock.3_6864MHz_external=External 3.6864 MHz
645.menu.clock.3_6864MHz_external.upload.speed=115200
645.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
645.menu.clock.3_6864MHz_external.build.clkpr=
645.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

645.menu.clock.2MHz_external=External 2 MHz
645.menu.clock.2MHz_external.upload.speed=9600
645.menu.clock.2MHz_external.bootloader.low_fuses=0xff
645.menu.clock.2MHz_external.build.clkpr=
645.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.2MHz_external.build.f_cpu=2000000L

645.menu.clock.1_8432MHz_external=External 1.8432 MHz
645.menu.clock.1_8432MHz_external.upload.speed=115200
645.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
645.menu.clock.1_8432MHz_external.build.clkpr=
645.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

645.menu.clock.1MHz_external=External 1 MHz
645.menu.clock.1MHz_external.upload.speed=9600
645.menu.clock.1MHz_external.bootloader.low_fuses=0xff
645.menu.clock.1MHz_external.build.clkpr=
645.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
645.menu.clock.1MHz_external.build.f_cpu=1000000L

645.menu.clock.8MHz_internal=Internal 8 MHz
645.menu.clock.8MHz_internal.upload.speed=38400
645.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.8MHz_internal.build.clkpr=
645.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
645.menu.clock.8MHz_internal.build.f_cpu=8000000L

645.menu.clock.4MHz_internal=Internal 4 MHz
645.menu.clock.4MHz_internal.upload.speed=9600
645.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
645.menu.clock.4MHz_internal.build.clock_speed=8000000L
645.menu.clock.4MHz_internal.build.f_cpu=4000000L

645.menu.clock.2MHz_internal=Internal 2 MHz
645.menu.clock.2MHz_internal.upload.speed=9600
645.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
645.menu.clock.2MHz_internal.build.clock_speed=8000000L
645.menu.clock.2MHz_internal.build.f_cpu=2000000L

645.menu.clock.1MHz_internal=Internal 1 MHz
645.menu.clock.1MHz_internal.upload.speed=9600
645.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
645.menu.clock.1MHz_internal.build.clkpr=
645.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
645.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega640  ####
#####################

# General
640.name=ATmega640
640.upload.tool=avrdude
640.upload.maximum_data_size=8192
640.bootloader.tool=avrdude
640.bootloader.unlock_bits=0xff
640.bootloader.lock_bits=0xcf
640.build.core=MCUdude_corefiles
640.build.board=AVR_ATmega640
640.build.mcu=atmega640
640.build.bootloader_led=B7
640.build.extra_flags={build.clkpr}

# Upload port select
640.menu.bootloader.uart0=Yes (UART0)
640.menu.bootloader.uart0.upload.maximum_size=64512
640.menu.bootloader.uart0.upload.protocol=arduino
640.menu.bootloader.uart0.upload.port=UART0
640.menu.bootloader.uart0.build.export_merged_output=true
640.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
640.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

640.menu.bootloader.uart1=Yes (UART1)
640.menu.bootloader.uart1.upload.maximum_size=64512
640.menu.bootloader.uart1.upload.protocol=arduino
640.menu.bootloader.uart1.upload.port=UART1
640.menu.bootloader.uart1.build.export_merged_output=true
640.menu.bootloader.uart1.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
640.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

640.menu.bootloader.uart2=Yes (UART2)
640.menu.bootloader.uart2.upload.maximum_size=64512
640.menu.bootloader.uart2.upload.protocol=arduino
640.menu.bootloader.uart2.upload.port=UART2
640.menu.bootloader.uart2.build.export_merged_output=true
640.menu.bootloader.uart2.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
640.menu.bootloader.uart2.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

640.menu.bootloader.uart3=Yes (UART3)
640.menu.bootloader.uart3.upload.maximum_size=64512
640.menu.bootloader.uart3.upload.protocol=arduino
640.menu.bootloader.uart3.upload.port=UART3
640.menu.bootloader.uart3.build.export_merged_output=true
640.menu.bootloader.uart3.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
640.menu.bootloader.uart3.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

640.menu.bootloader.no_bootloader=No bootloader
640.menu.bootloader.no_bootloader.upload.maximum_size=65536
640.menu.bootloader.no_bootloader.build.export_merged_output=false
640.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
640.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
640.menu.eeprom.keep=EEPROM retained
640.menu.eeprom.keep.bootloader.eesave_bit=0
640.menu.eeprom.erase=EEPROM not retained
640.menu.eeprom.erase.bootloader.eesave_bit=1

# Pinouts
640.menu.pinout.mega_pinout=Arduino MEGA pinout
640.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
640.menu.pinout.avr_pinout=AVR pinout
640.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
640.menu.BOD.2v7=BOD 2.7V
640.menu.BOD.2v7.bootloader.extended_fuses=0xfd
640.menu.BOD.4v3=BOD 4.3V
640.menu.BOD.4v3.bootloader.extended_fuses=0xfc
640.menu.BOD.1v8=BOD 1.8V
640.menu.BOD.1v8.bootloader.extended_fuses=0xfe
640.menu.BOD.disabled=BOD disabled
640.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
640.menu.LTO.Os=LTO disabled
640.menu.LTO.Os.compiler.c.extra_flags=
640.menu.LTO.Os.compiler.c.elf.extra_flags=
640.menu.LTO.Os.compiler.cpp.extra_flags=
640.menu.LTO.Os.ltoarcmd=avr-ar

640.menu.LTO.Os_flto=LTO enabled
640.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
640.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
640.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
640.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

