black-box-iot/black-box-iot.github.io/BlackBox-2.2.0/boards.txt
# Variants
329.menu.variant.model329P=329P/PA
329.menu.variant.model329P.build.mcu=atmega329p
329.menu.variant.model329P.build.variant=64-pin-avr
329.menu.variant.model329P.build.board=AVR_ATmega329
329.menu.variant.model329P.build.bootloader_led=B5

329.menu.variant.model329=329/A
329.menu.variant.model329.build.mcu=atmega329
329.menu.variant.model329.build.variant=64-pin-avr
329.menu.variant.model329.build.board=AVR_ATmega329
329.menu.variant.model329.build.bootloader_led=B5

329.menu.variant.model3290P=3290P/PA
329.menu.variant.model3290P.build.mcu=atmega3290p
329.menu.variant.model3290P.build.variant=100-pin-avr
329.menu.variant.model3290P.build.board=AVR_ATmega3290
329.menu.variant.model3290P.build.bootloader_led=B7

329.menu.variant.model3290=3290/A
329.menu.variant.model3290.build.mcu=atmega3290
329.menu.variant.model3290.build.variant=100-pin-avr
329.menu.variant.model3290.build.board=AVR_ATmega3290
329.menu.variant.model3290.build.bootloader_led=B7

# Brown out detection
329.menu.BOD.2v7=BOD 2.7V
329.menu.BOD.2v7.bootloader.extended_fuses=0xfb
329.menu.BOD.4v3=BOD 4.3V
329.menu.BOD.4v3.bootloader.extended_fuses=0xf9
329.menu.BOD.1v8=BOD 1.8V
329.menu.BOD.1v8.bootloader.extended_fuses=0xfd
329.menu.BOD.disabled=BOD disabled
329.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
329.menu.LTO.Os=LTO disabled
329.menu.LTO.Os.compiler.c.extra_flags=
329.menu.LTO.Os.compiler.c.elf.extra_flags=
329.menu.LTO.Os.compiler.cpp.extra_flags=
329.menu.LTO.Os.ltoarcmd=avr-ar

329.menu.LTO.Os_flto=LTO enabled
329.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
329.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
329.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
329.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
329.menu.clock.16MHz_external=External 16 MHz
329.menu.clock.16MHz_external.upload.speed=115200
329.menu.clock.16MHz_external.bootloader.low_fuses=0xff
329.menu.clock.16MHz_external.build.clkpr=
329.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.16MHz_external.build.f_cpu=16000000L

329.menu.clock.20MHz_external=External 20 MHz
329.menu.clock.20MHz_external.upload.speed=115200
329.menu.clock.20MHz_external.bootloader.low_fuses=0xff
329.menu.clock.20MHz_external.build.clkpr=
329.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.20MHz_external.build.f_cpu=20000000L

329.menu.clock.18_432MHz_external=External 18.4320 MHz
329.menu.clock.18_432MHz_external.upload.speed=115200
329.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
329.menu.clock.18_432MHz_external.build.clkpr=
329.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.18_432MHz_external.build.f_cpu=18432000L

329.menu.clock.14_7456MHz_external=External 14.7456 MHz
329.menu.clock.14_7456MHz_external.upload.speed=115200
329.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
329.menu.clock.14_7456MHz_external.build.clkpr=
329.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

329.menu.clock.12MHz_external=External 12 MHz
329.menu.clock.12MHz_external.upload.speed=57600
329.menu.clock.12MHz_external.bootloader.low_fuses=0xff
329.menu.clock.12MHz_external.build.clkpr=
329.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.12MHz_external.build.f_cpu=12000000L

329.menu.clock.11_0592MHz_external=External 11.0592 MHz
329.menu.clock.11_0592MHz_external.upload.speed=115200
329.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
329.menu.clock.11_0592MHz_external.build.clkpr=
329.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

329.menu.clock.8MHz_external=External 8 MHz
329.menu.clock.8MHz_external.upload.speed=57600
329.menu.clock.8MHz_external.bootloader.low_fuses=0xff
329.menu.clock.8MHz_external.build.clkpr=
329.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.8MHz_external.build.f_cpu=8000000L

329.menu.clock.7_3728MHz_external=External 7.3728 MHz
329.menu.clock.7_3728MHz_external.upload.speed=115200
329.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
329.menu.clock.7_3728MHz_external.build.clkpr=
329.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

329.menu.clock.4MHz_external=External 4 MHz
329.menu.clock.4MHz_external.upload.speed=9600
329.menu.clock.4MHz_external.bootloader.low_fuses=0xff
329.menu.clock.4MHz_external.build.clkpr=
329.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.4MHz_external.build.f_cpu=4000000L

329.menu.clock.3_6864MHz_external=External 3.6864 MHz
329.menu.clock.3_6864MHz_external.upload.speed=115200
329.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
329.menu.clock.3_6864MHz_external.build.clkpr=
329.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

329.menu.clock.2MHz_external=External 2 MHz
329.menu.clock.2MHz_external.upload.speed=9600
329.menu.clock.2MHz_external.bootloader.low_fuses=0xff
329.menu.clock.2MHz_external.build.clkpr=
329.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.2MHz_external.build.f_cpu=2000000L

329.menu.clock.1_8432MHz_external=External 1.8432 MHz
329.menu.clock.1_8432MHz_external.upload.speed=115200
329.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
329.menu.clock.1_8432MHz_external.build.clkpr=
329.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

329.menu.clock.1MHz_external=External 1 MHz
329.menu.clock.1MHz_external.upload.speed=9600
329.menu.clock.1MHz_external.bootloader.low_fuses=0xff
329.menu.clock.1MHz_external.build.clkpr=
329.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.1MHz_external.build.f_cpu=1000000L

329.menu.clock.8MHz_internal=Internal 8 MHz
329.menu.clock.8MHz_internal.upload.speed=38400
329.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
329.menu.clock.8MHz_internal.build.clkpr=
329.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
329.menu.clock.8MHz_internal.build.f_cpu=8000000L

