black-box-iot/black-box-iot.github.io/BlackBox-2.2.0/boards.txt
325.menu.clock.4MHz_external=External 4 MHz
325.menu.clock.4MHz_external.upload.speed=9600
325.menu.clock.4MHz_external.bootloader.low_fuses=0xff
325.menu.clock.4MHz_external.build.clkpr=
325.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
325.menu.clock.4MHz_external.build.f_cpu=4000000L

325.menu.clock.3_6864MHz_external=External 3.6864 MHz
325.menu.clock.3_6864MHz_external.upload.speed=115200
325.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
325.menu.clock.3_6864MHz_external.build.clkpr=
325.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
325.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

325.menu.clock.2MHz_external=External 2 MHz
325.menu.clock.2MHz_external.upload.speed=9600
325.menu.clock.2MHz_external.bootloader.low_fuses=0xff
325.menu.clock.2MHz_external.build.clkpr=
325.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
325.menu.clock.2MHz_external.build.f_cpu=2000000L

325.menu.clock.1_8432MHz_external=External 1.8432 MHz
325.menu.clock.1_8432MHz_external.upload.speed=115200
325.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
325.menu.clock.1_8432MHz_external.build.clkpr=
325.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
325.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

325.menu.clock.1MHz_external=External 1 MHz
325.menu.clock.1MHz_external.upload.speed=9600
325.menu.clock.1MHz_external.bootloader.low_fuses=0xff
325.menu.clock.1MHz_external.build.clkpr=
325.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
325.menu.clock.1MHz_external.build.f_cpu=1000000L

325.menu.clock.8MHz_internal=Internal 8 MHz
325.menu.clock.8MHz_internal.upload.speed=38400
325.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
325.menu.clock.8MHz_internal.build.clkpr=
325.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
325.menu.clock.8MHz_internal.build.f_cpu=8000000L

325.menu.clock.4MHz_internal=Internal 4 MHz
325.menu.clock.4MHz_internal.upload.speed=9600
325.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
325.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
325.menu.clock.4MHz_internal.build.clock_speed=8000000L
325.menu.clock.4MHz_internal.build.f_cpu=4000000L

325.menu.clock.2MHz_internal=Internal 2 MHz
325.menu.clock.2MHz_internal.upload.speed=9600
325.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
325.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
325.menu.clock.2MHz_internal.build.clock_speed=8000000L
325.menu.clock.2MHz_internal.build.f_cpu=2000000L

325.menu.clock.1MHz_internal=Internal 1 MHz
325.menu.clock.1MHz_internal.upload.speed=9600
325.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
325.menu.clock.1MHz_internal.build.clkpr=
325.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
325.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega169  ####
#####################

# General
169.name=ATmega169
169.upload.tool=avrdude
169.upload.maximum_data_size=1024
169.bootloader.tool=avrdude
169.bootloader.unlock_bits=0xff
169.bootloader.lock_bits=0xcf
169.build.core=MCUdude_corefiles
169.build.variant=64-pin-avr
169.build.board=AVR_ATmega169
169.build.bootloader_led=B5
169.build.extra_flags={build.clkpr}

# Upload port select
169.menu.bootloader.uart0=Yes (UART0)
169.menu.bootloader.uart0.upload.maximum_size=15872
169.menu.bootloader.uart0.upload.protocol=arduino
169.menu.bootloader.uart0.upload.port=UART0
169.menu.bootloader.uart0.build.export_merged_output=true
169.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
169.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}.hex

169.menu.bootloader.no_bootloader=No bootloader
169.menu.bootloader.no_bootloader.upload.maximum_size=16384
169.menu.bootloader.no_bootloader.build.export_merged_output=false
169.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
169.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
169.menu.eeprom.keep=EEPROM retained
169.menu.eeprom.keep.bootloader.eesave_bit=0
169.menu.eeprom.erase=EEPROM not retained
169.menu.eeprom.erase.bootloader.eesave_bit=1

# Variants
169.menu.variant.modelP=169P/PA
169.menu.variant.modelP.build.mcu=atmega169p
169.menu.variant.modelA=169/A
169.menu.variant.modelA.build.mcu=atmega169

# Brown out detection
169.menu.BOD.2v7=BOD 2.7V
169.menu.BOD.2v7.bootloader.extended_fuses=0xfb
169.menu.BOD.4v3=BOD 4.3V
169.menu.BOD.4v3.bootloader.extended_fuses=0xf9
169.menu.BOD.1v8=BOD 1.8V
169.menu.BOD.1v8.bootloader.extended_fuses=0xfd
169.menu.BOD.disabled=BOD disabled
169.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
169.menu.LTO.Os=LTO disabled
169.menu.LTO.Os.compiler.c.extra_flags=
169.menu.LTO.Os.compiler.c.elf.extra_flags=
169.menu.LTO.Os.compiler.cpp.extra_flags=
169.menu.LTO.Os.ltoarcmd=avr-ar

169.menu.LTO.Os_flto=LTO enabled
169.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
169.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
169.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
169.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
169.menu.clock.16MHz_external=External 16 MHz
169.menu.clock.16MHz_external.upload.speed=115200
169.menu.clock.16MHz_external.bootloader.low_fuses=0xff
169.menu.clock.16MHz_external.build.clkpr=
169.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
169.menu.clock.16MHz_external.build.f_cpu=16000000L

169.menu.clock.20MHz_external=External 20 MHz
169.menu.clock.20MHz_external.upload.speed=115200
169.menu.clock.20MHz_external.bootloader.low_fuses=0xff
169.menu.clock.20MHz_external.build.clkpr=
169.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
169.menu.clock.20MHz_external.build.f_cpu=20000000L

169.menu.clock.18_432MHz_external=External 18.4320 MHz
169.menu.clock.18_432MHz_external.upload.speed=115200
169.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
169.menu.clock.18_432MHz_external.build.clkpr=
169.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
169.menu.clock.18_432MHz_external.build.f_cpu=18432000L

169.menu.clock.14_7456MHz_external=External 14.7456 MHz
169.menu.clock.14_7456MHz_external.upload.speed=115200
169.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
169.menu.clock.14_7456MHz_external.build.clkpr=
169.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
169.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

169.menu.clock.12MHz_external=External 12 MHz
169.menu.clock.12MHz_external.upload.speed=57600
169.menu.clock.12MHz_external.bootloader.low_fuses=0xff
169.menu.clock.12MHz_external.build.clkpr=
169.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
169.menu.clock.12MHz_external.build.f_cpu=12000000L

