black-box-iot/black-box-iot.github.io/BlackBox-2.2.0/boards.txt
can64.menu.clock.3_6864MHz_external=External 3.6864 MHz
can64.menu.clock.3_6864MHz_external.upload.speed=115200
can64.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xcd
can64.menu.clock.3_6864MHz_external.build.clkpr=
can64.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
can64.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

can64.menu.clock.2MHz_external=External 2 MHz
can64.menu.clock.2MHz_external.upload.speed=9600
can64.menu.clock.2MHz_external.bootloader.low_fuses=0xcb
can64.menu.clock.2MHz_external.build.clkpr=
can64.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
can64.menu.clock.2MHz_external.build.f_cpu=2000000L

can64.menu.clock.1_8432MHz_external=External 1.8432 MHz
can64.menu.clock.1_8432MHz_external.upload.speed=115200
can64.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xcb
can64.menu.clock.1_8432MHz_external.build.clkpr=
can64.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
can64.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

can64.menu.clock.1MHz_external=External 1 MHz
can64.menu.clock.1MHz_external.upload.speed=9600
can64.menu.clock.1MHz_external.bootloader.low_fuses=0xcb
can64.menu.clock.1MHz_external.build.clkpr=
can64.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
can64.menu.clock.1MHz_external.build.f_cpu=1000000L

can64.menu.clock.8MHz_internal=Internal 8 MHz
can64.menu.clock.8MHz_internal.upload.speed=38400
can64.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
can64.menu.clock.8MHz_internal.build.clkpr=
can64.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
can64.menu.clock.8MHz_internal.build.f_cpu=8000000L

can64.menu.clock.1MHz_internal=Internal 1 MHz
can64.menu.clock.1MHz_internal.upload.speed=9600
can64.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
can64.menu.clock.1MHz_internal.build.clkpr=
can64.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
can64.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  AT90CAN32  ####
#####################

# General
can32.name=AT90CAN32
can32.upload.tool=avrdude
can32.upload.maximum_data_size=2048
can32.bootloader.tool=avrdude
can32.bootloader.unlock_bits=0xff
can32.bootloader.lock_bits=0xcf
can32.build.core=MCUdude_corefiles
can32.build.variant=64-pin-avr
can32.build.board=AVR_AT90CAN32
can32.build.mcu=at90can32
can32.build.bootloader_led=B5
can32.build.extra_flags={build.clkpr}

# Upload port select
can32.menu.bootloader.uart0=Yes (UART0)
can32.menu.bootloader.uart0.upload.maximum_size=31744
can32.menu.bootloader.uart0.upload.protocol=arduino
can32.menu.bootloader.uart0.upload.port=UART0
can32.menu.bootloader.uart0.build.export_merged_output=true
can32.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
can32.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

can32.menu.bootloader.uart1=Yes (UART1)
can32.menu.bootloader.uart1.upload.maximum_size=31744
can32.menu.bootloader.uart1.upload.protocol=arduino
can32.menu.bootloader.uart1.upload.port=UART1
can32.menu.bootloader.uart1.build.export_merged_output=true
can32.menu.bootloader.uart1.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
can32.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

can32.menu.bootloader.no_bootloader=No bootloader
can32.menu.bootloader.no_bootloader.upload.maximum_size=32768
can32.menu.bootloader.no_bootloader.build.export_merged_output=false
can32.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
can32.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
can32.menu.eeprom.keep=EEPROM retained
can32.menu.eeprom.keep.bootloader.eesave_bit=0
can32.menu.eeprom.erase=EEPROM not retained
can32.menu.eeprom.erase.bootloader.eesave_bit=1

# Brown out detection
can32.menu.BOD.2v7=BOD 2.7V
can32.menu.BOD.2v7.bootloader.extended_fuses=0xf5
can32.menu.BOD.4v1=BOD 4.1V
can32.menu.BOD.4v1.bootloader.extended_fuses=0xfd
can32.menu.BOD.4v0=BOD 4.0V
can32.menu.BOD.4v0.bootloader.extended_fuses=0xfb
can32.menu.BOD.3v9=BOD 3.9V
can32.menu.BOD.3v9.bootloader.extended_fuses=0xf9
can32.menu.BOD.3v8=BOD 3.8V
can32.menu.BOD.3v8.bootloader.extended_fuses=0xf7
can32.menu.BOD.2v6=BOD 2.6V
can32.menu.BOD.2v6.bootloader.extended_fuses=0xf3
can32.menu.BOD.2v5=BOD 2.5V
can32.menu.BOD.2v5.bootloader.extended_fuses=0xf1
can32.menu.BOD.disabled=BOD disabled
can32.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
can32.menu.LTO.Os=LTO disabled
can32.menu.LTO.Os.compiler.c.extra_flags=
can32.menu.LTO.Os.compiler.c.elf.extra_flags=
can32.menu.LTO.Os.compiler.cpp.extra_flags=
can32.menu.LTO.Os.ltoarcmd=avr-ar

can32.menu.LTO.Os_flto=LTO enabled
can32.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
can32.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
can32.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
can32.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
can32.menu.clock.16MHz_external=External 16 MHz
can32.menu.clock.16MHz_external.upload.speed=115200
can32.menu.clock.16MHz_external.bootloader.low_fuses=0xcf
can32.menu.clock.16MHz_external.build.clkpr=
can32.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
can32.menu.clock.16MHz_external.build.f_cpu=16000000L

can32.menu.clock.20MHz_external=External 20 MHz
can32.menu.clock.20MHz_external.upload.speed=115200
can32.menu.clock.20MHz_external.bootloader.low_fuses=0xcf
can32.menu.clock.20MHz_external.build.clkpr=
can32.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
can32.menu.clock.20MHz_external.build.f_cpu=20000000L

can32.menu.clock.18_432MHz_external=External 18.4320 MHz
can32.menu.clock.18_432MHz_external.upload.speed=115200
can32.menu.clock.18_432MHz_external.bootloader.low_fuses=0xcf
can32.menu.clock.18_432MHz_external.build.clkpr=
can32.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
can32.menu.clock.18_432MHz_external.build.f_cpu=18432000L

